miro-kostadinov/tmos/tmos/hardware/stm32/otg_hs_stm32.h
/**************************************************************************//**
 * @ingroup	hardware_stm32_usb
 * @file	hardware/stm32/otg_hs_stm32.h
 * @brief  	STM32 USB OTG HS
 * @date    30. November 2012
 * @author	Miroslav Kostadinov
 *
 * @defgroup hardware_stm32_usb HS/FS USB OTG
 * @ingroup	 hardware_stm32
 * Source and definitions for STM32 HS USB OTG Controller
 * @{
 *
 ******************************************************************************/

#ifndef OTG_HS_STM32_H_
#define OTG_HS_STM32_H_

#include <mcu_inc.h>
#include <tmos_types.h>

#ifndef OTG_MAX_FIFOS
#define OTG_MAX_FIFOS	15	//!< max number of FIFOs
#endif

/*******************************************************************************
 *  USB OTG HS Registers
 ******************************************************************************/

/// Core global registers 0x0000
typedef struct
{
  __IO uint32_t GOTGCTL;      		//!< (otg Offset: 0x0000) USB_OTG Control and Status Register
  __IO uint32_t GOTGINT;      		//!< (otg Offset: 0x0004) USB_OTG Interrupt Register
  __IO uint32_t GAHBCFG;      		//!< (otg Offset: 0x0008) Core AHB Configuration Register
  __IO uint32_t GUSBCFG;      		//!< (otg Offset: 0x000C) Core USB Configuration Register
  __IO uint32_t GRSTCTL;      		//!< (otg Offset: 0x0010) Core Reset Register
  __IO uint32_t GINTSTS;      		//!< (otg Offset: 0x0014) Core Interrupt Register
  __IO uint32_t GINTMSK;      		//!< (otg Offset: 0x0018) Core Interrupt Mask Register
  __IO uint32_t GRXSTSR;      		//!< (otg Offset: 0x001C) Receive Sts Q Read Register
  __IO uint32_t GRXSTSP;      		//!< (otg Offset: 0x0020) Receive Sts Q Read & POP Register
  __IO uint32_t GRXFSIZ;      		//!< (otg Offset: 0x0024) Receive FIFO Size Register
  __IO uint32_t DIEPTXF0_HNPTXFSIZ; //!< (otg Offset: 0x0028) EP0 / Non Periodic Tx FIFO Size Register
  __IO uint32_t GNPTXSTS;   	 	//!< (otg Offset: 0x002C) Non Periodic Tx FIFO/Queue Sts reg
  __IO uint32_t reserved1[2];    	//!< (otg Offset: 0x0030) Reserved
  __IO uint32_t GCCFG;        		//!< (otg Offset: 0x0038) General Purpose IO Register
  __IO uint32_t CID;          		//!< (otg Offset: 0x003C) User ID Register
  __IO uint32_t reserved2[48];   	//!< (otg Offset: 0x0040) Reserved
  __IO uint32_t HPTXFSIZ; 			//!< (otg Offset: 0x0100) Host periodic transmit FIFO size register
  __IO uint32_t DIEPTXF[OTG_MAX_FIFOS];//!< (otg Offset: 0x0104) device IN endpoint transmit FIFO size register
} OTG_CORE_REGS;


/// Host-mode registers 0x0400
typedef struct
{
  __IO uint32_t HCFG;             	//!< (otg Offset: 0x0400) Host Configuration Register
  __IO uint32_t HFIR;      			//!< (otg Offset: 0x0404) Host Frame Interval Register
  __IO uint32_t HFNUM;         		//!< (otg Offset: 0x0408) Host Frame Nbr/Frame Remaining
  __IO uint32_t reserved; 	        //!< (otg Offset: 0x040C) Reserved
  __IO uint32_t HPTXSTS;   			//!< (otg Offset: 0x0410) Host Periodic Tx FIFO/ Queue Status
  __IO uint32_t HAINT;   			//!< (otg Offset: 0x0414) Host All Channels Interrupt Register
  __IO uint32_t HAINTMSK;   		//!< (otg Offset: 0x0418) Host All Channels Interrupt Mask
} OTG_HOST_REGS;


/// Host channel-specific registers  0x0500, 0x0520... +x*0x20
typedef struct
{
  __IO uint32_t HCCHAR;   			//!< (otg Offset: 0x0500+) Host channel-x characteristics register
  __IO uint32_t HCSPLT;             //!< (otg Offset: 0x0504+) host channel-x split control register
  __IO uint32_t HCINT;              //!< (otg Offset: 0x0508+) Host channel-x interrupt register
  __IO uint32_t HCINTMSK;           //!< (otg Offset: 0x050C+) Host channel-x interrupt mask register
  __IO uint32_t HCTSIZ;             //!< (otg Offset: 0x0510+) Host channel-x transfer size register
  __IO uint32_t HCDMA;              //!< (otg Offset: 0x0514+) host channel-x DMA address register
  __IO uint32_t reserved[2];        //!< (otg Offset: 0x051C+) reserved
} OTG_HC_REGS;


/// Device mode CSRs 0x0800
typedef struct
{
  __IO uint32_t DCFG;         		//!< (otg Offset: 0x0800) device Configuration Register
  __IO uint32_t DCTL;         		//!< (otg Offset: 0x0804) device Control Register
  __IO uint32_t DSTS;         		//!< (otg Offset: 0x0808) device Status Register (RO)
  __IO uint32_t reserved1;          //!< (otg Offset: 0x080C) Reserved
  __IO uint32_t DIEPMSK;   			//!< (otg Offset: 0x0810) device IN Endpoint Mask
  __IO uint32_t DOEPMSK;  			//!< (otg Offset: 0x0814) device OUT Endpoint Mask
  __IO uint32_t DAINT;     			//!< (otg Offset: 0x0818) device All Endpoints Itr Reg
  __IO uint32_t DAINTMSK; 			//!< (otg Offset: 0x081C) device All Endpoints Itr Mask
  __IO uint32_t reserved2[2];       //!< (otg Offset: 0x0820) Reserved
  __IO uint32_t DVBUSDIS;    		//!< (otg Offset: 0x0828) device VBUS discharge Register
  __IO uint32_t DVBUSPULSE;  		//!< (otg Offset: 0x082C) device VBUS Pulse Register
  __IO uint32_t DTHRCTL;     		//!< (otg Offset: 0x0830) device thr
  __IO uint32_t DIEPEMPMSK; 		//!< (otg Offset: 0x0834) device empty msk
  __IO uint32_t DEACHINT;    		//!< (otg Offset: 0x0838) dedicated EP interrupt
  __IO uint32_t DEACHINTMSK;    	//!< (otg Offset: 0x083C) dedicated EP msk
  __IO uint32_t DIEPEACHMSK1;      	//!< (otg Offset: 0x0840) dedicated in EP-1 interrupt
  __IO uint32_t DINEP1MSK;  		//!< (otg Offset: 0x0844) dedicated EP mask (as DIEPMSK)
  __IO uint32_t reserved3[14];    	//!< (otg Offset: 0x0848) Reserved
  __IO uint32_t DOEPEACHMSK1; 		//!< (otg Offset: 0x0880) device each OUT endpoint-1 interrupt register
  __IO uint32_t DOUTEP1MSK; 		//!< (otg Offset: 0x0884) dedicated EP msk (as DOEPMSK)
} OTG_DEVICE_REGS;


/// Device IN Endpoint CSRs 0x0900, 0x0920... + (ep_num * 0x20)
typedef struct
{
  __IO uint32_t DIEPCTL; 			//!< (otg Offset: 0x0900+) dev IN Endpoint Control Reg
  __IO uint32_t reserved1;          //!< (otg Offset: 0x0904+) Reserved
  __IO uint32_t DIEPINT; 			//!< (otg Offset: 0x0908+) dev IN Endpoint Itr Reg
  __IO uint32_t reserved2;          //!< (otg Offset: 0x090C+) Reserved
  __IO uint32_t DIEPTSIZ; 			//!< (otg Offset: 0x0910+) IN Endpoint Txfer Size
  __IO uint32_t DIEPDMA; 			//!< (otg Offset: 0x0914+) IN Endpoint DMA Address Reg
  __IO uint32_t DTXFSTS;			//!< (otg Offset: 0x0918+) IN Endpoint Tx FIFO Status Reg
  __IO uint32_t reserved3;          //!< (otg Offset: 0x091C+) Reserved
} OTG_IN_EPT_REGS;


