miro-kostadinov/tmos/tmos/hardware/stm32/otg_hs_stm32.h
/// Device OUT Endpoint CSRs 0x0B00, 0x0B20... + (ep_num * 0x20)
typedef struct
{
  __IO uint32_t DOEPCTL;       		//!< (otg Offset: 0x0B00+) dev OUT Endpoint Control Reg
  __IO uint32_t reserved1;          //!< (otg Offset: 0x0B04+) Reserved
  __IO uint32_t DOEPINT;       		//!< (otg Offset: 0x0B08+) dev OUT Endpoint Itr Reg
  __IO uint32_t reserved2;          //!< (otg Offset: 0x0B0C+) Reserved
  __IO uint32_t DOEPTSIZ;      		//!< (otg Offset: 0x0B10+) dev OUT Endpoint Txfer Size
  __IO uint32_t DOEPDMA;       		//!< (otg Offset: 0x0B14+) dev OUT Endpoint DMA Address
  __IO uint32_t reserved3[2];       //!< (otg Offset: 0x0B18+) Reserved
} OTG_OUT_EPT_REGS;


/// Data FIFO (DFIFO) access register 0x1000
typedef struct
{
  __IO uint32_t DFIFO[1024];   		//!< (otg Offset: 0x1000+) Data FIFO (DFIFO) access
} OTG_DFIFO_REGS;


/// USB peripheral registers
typedef struct
{
  OTG_CORE_REGS		core_regs;						//!< (otg Offset: 0x0000) Core global CSRs
  uint32_t			reserved1[191 - OTG_MAX_FIFOS];	//!< (otg Offset: 0x0104+x) reserved
  OTG_HOST_REGS     host_regs;						//!< (otg Offset: 0x0400) Host mode CSRs
  uint32_t			reserved2[9];					//!< (otg Offset: 0x041C) reserved
  __IO uint32_t     HPRT;							//!< (otg Offset: 0x0440) Host port control and status register
  uint32_t			reserved3[47];					//!< (otg Offset: 0x0444) reserved
  OTG_HC_REGS		HC_REGS[OTG_MAX_FIFOS];			//!< (otg Offset: 0x0500) Host Channel CSRs
  uint32_t			reserved4[192- OTG_MAX_FIFOS*8];//!< (otg Offset: 0x0500+x*8) reserved
  OTG_DEVICE_REGS   device_regs;					//!< (otg Offset: 0x0800) Device mode CSRs
  uint32_t			reserved5[30];					//!< (otg Offset: 0x0888) reserved
  OTG_IN_EPT_REGS   in_ept_regs[OTG_MAX_FIFOS];		//!< (otg Offset: 0x0900) device IN endpoint CSRs
  uint32_t			reserved6[128- OTG_MAX_FIFOS*8];//!< (otg Offset: 0x0900+x*8) reserved
  OTG_OUT_EPT_REGS  out_ept_regs[OTG_MAX_FIFOS];	//!< (otg Offset: 0x0B00) device OUT endpoint CSRs
  uint32_t			reserved7[192- OTG_MAX_FIFOS*8];//!< (otg Offset: 0x0B00+x*8) reserved
  __IO uint32_t     PCGCCTL; 						//!< (otg Offset: 0x0E00) power and clock gating control register
  uint32_t			reserved8[127];					//!< (otg Offset: 0x0E04) reserved
  OTG_DFIFO_REGS    DFIFO[OTG_MAX_FIFOS];			//!< (otg Offset: 0x1000) Data FIFO (DFIFO) access registers
} USB_TypeDef;


/* ---------- Core global registers 0x0000  -----------------------------------*/
/***************************************************************************//**
 * @relates OTG_CORE_REGS
 * @{
 ******************************************************************************/

/** @name GOTGCTL:	(otg Offset: 0x0000) USB_OTG Control and Status Register  	*/
/** @{ */
#define OTG_GOTGCTL_BSVLD           (1u<<19)    //!< B-Session Valid
#define OTG_GOTGCTL_ASVLD           (1u<<18)    //!< A-Session Valid
#define OTG_GOTGCTL_DBCT            (1u<<17)    //!< Long/Short debounce time
#define OTG_GOTGCTL_CIDSTS          (1u<<16)    //!< Connector ID status
#define OTG_GOTGCTL_DHNPEN          (1u<<11)    //!< Device HNP enabled
#define OTG_GOTGCTL_HSHNPEN         (1u<<10)    //!< Host Set HNP enable
#define OTG_GOTGCTL_HNPRQ           (1u<<9)     //!< HNP request
#define OTG_GOTGCTL_HNGSCS          (1u<<8)     //!< Host negotiation success
#define OTG_GOTGCTL_SRQ             (1u<<1)     //!< Session request
#define OTG_GOTGCTL_SRQSCS          (1u<<0)     //!< Session request success
/** @} */

/** @name GOTGINT:  (otg Offset: 0x0004) USB_OTG Interrupt Register			 	*/
/** @{ */
#define OTG_GOTGINT_DBCDNE          (1u<<19)    //!< Debounce done
#define OTG_GOTGINT_ADTOCHG         (1u<<18)    //!< A-Device timeout change
#define OTG_GOTGINT_HNGDET          (1u<<17)    //!< Host negotiation detected
#define OTG_GOTGINT_HNSSCHG         (1u<<9)     //!< Host negotiation success status change
#define OTG_GOTGINT_SRSSCHG         (1u<<8)     //!< Session request success status change
#define OTG_GOTGINT_SEDET           (1u<<2)     //!< Session end detected
/** @} */

/** @name GAHBCFG:  (otg Offset: 0x0008) Core AHB Configuration Register		*/
/** @{ */
#define OTG_GAHBCFG_PTXFELVL        (1u<<8)     //!< Periodic TxFIFO empty level
#define OTG_GAHBCFG_TXFELVL         (1u<<7)     //!< Non-periodic TxFIFO empty level
#define OTG_GAHBCFG_DMAEN           (1u<<5)     //!< DMA enable (HS only
#define OTG_GAHBCFG_HBSTLEN_Msk     (15u<<1)    //!< Burst length/type mask (HS only)
#define OTG_GAHBCFG_HBSTLEN(n)      ((n)<<1)    //!< Burst length/type (HS only)
#define OTG_GAHBCFG_GINTMSK         (1u<<0)     //!< Global interrupt mask
/** @} */

/** @name GUSBCFG:  (otg Offset: 0x000C) Core USB Configuration Register		*/
/** @{ */
#define OTG_GUSBCFG_CTXPKT          (1u<<31)    //!< Corrupt Tx packet
#define OTG_GUSBCFG_FDMOD           (1u<<30)    //!< Force Device Mode
#define OTG_GUSBCFG_FHMOD           (1u<<29)    //!< Force Host Mode
#define OTG_GUSBCFG_ULPIIPD         (1u<<25)    //!< ULPI interface protect disable
#define OTG_GUSBCFG_PTCI            (1u<<24)    //!< Indicator pass through
#define OTG_GUSBCFG_PCCI            (1u<<23)    //!< Indicator complement
#define OTG_GUSBCFG_TSDPS           (1u<<22)    //!< TermSel DLine pulsing selection
#define OTG_GUSBCFG_ULPIEVBUSI      (1u<<21)    //!< ULPI external VBUS indicator
#define OTG_GUSBCFG_ULPIEVBUSD      (1u<<20)    //!< ULPI External VBUS Drive
#define OTG_GUSBCFG_ULPICSM         (1u<<19)    //!< ULPI Clock SuspendM
#define OTG_GUSBCFG_ULPIAR          (1u<<18)    //!< ULPI Auto-resume
#define OTG_GUSBCFG_ULPIFSLS	    (1u<<17)    //!< ULPI FS/LS select
#define OTG_GUSBCFG_TRDT_Msk        (15u<<10)   //!< USB Turnaround time field mask
#define OTG_GUSBCFG_TRDT(n)         ((n)<<10)   //!< USB Turnaround time field value
#define OTG_GUSBCFG_HNPCAP          (1u<<9)     //!< HNP-Capable
#define OTG_GUSBCFG_SRPCAP          (1u<<8)     //!< SRP-Capable
#define OTG_GUSBCFG_PHYSEL          (1u<<6)     //!< USB 2.0 High-Speed PHY or USB 1.1 Full-Speed serial transceiver Select
#define OTG_GUSBCFG_PHYSEL_ULPI		(0u<<6)     //!<  USB 2.0 high-speed ULPI PHY
#define OTG_GUSBCFG_PHYSEL_FSSER    (1u<<6)     //!<  USB 1.1 full-speed serial transceiver
#define OTG_GUSBCFG_TOCAL_Msk       (7u<<0)     //!< HS/FS timeout calibration field mask
#define OTG_GUSBCFG_TOCAL(n)        ((n)<<0)    //!< HS/FS timeout calibration
/** @} */

/** @name GRSTCTL:  (otg Offset: 0x0010) Core Reset Register					*/
/** @{ */
#define OTG_GRSTCTL_AHBIDL          (1u<<31)    //!< AHB Master Idle
#define OTG_GRSTCTL_TXFNUM_Msk      (31u<<6)    //!< TxFIFO number field mask
#define OTG_GRSTCTL_TXFNUM(n)       ((n)<<6)    //!< TxFIFO number field value
#define OTG_GRSTCTL_TXFFLSH         (1u<<5)     //!< TxFIFO flush
#define OTG_GRSTCTL_RXFFLSH         (1u<<4)     //!< RxFIFO flush
#define OTG_GRSTCTL_FCRST           (1u<<2)     //!< Host frame counter reset
#define OTG_GRSTCTL_HSRST           (1u<<1)     //!< HClk soft reset
#define OTG_GRSTCTL_CSRST           (1u<<0)     //!< Core soft reset
/** @} */

/** @name GINTSTS:  (otg Offset: 0x0014) Core Interrupt Register				*/
/** @{ */
#define OTG_GINTSTS_WKUPINT         (1u<<31)    //!< Resume/Remote wakeup detected interrupt
#define OTG_GINTSTS_SRQINT          (1u<<30)    //!< Session request/New session detected interrupt
#define OTG_GINTSTS_DISCINT         (1u<<29)    //!< Disconnect detected interrupt
#define OTG_GINTSTS_CIDSCHG         (1u<<28)    //!< Connector ID status change
#define OTG_GINTSTS_PTXFE           (1u<<26)    //!< Periodic TxFIFO empty
#define OTG_GINTSTS_HCINT           (1u<<25)    //!< Host channels interrupt
#define OTG_GINTSTS_HPRTINT         (1u<<24)    //!< Host port interrupt
#define OTG_GINTSTS_RESETDET        (1u<<23)    //!< Device Reset detected Interrupt
#define OTG_GINTSTS_FETSUSP         (1u<<22)    //!< Data Fetch Suspended (FetSusp)
#define OTG_GINTSTS_IPXFR           (1u<<21)    //!< Incomplete periodic transfer
#define OTG_GINTSTS_IISOOXFR        (1u<<21)    //!< Incomplete isochronous OUT transfer
#define OTG_GINTSTS_IISOIXFR        (1u<<20)    //!< Incomplete isochronous IN transfer
#define OTG_GINTSTS_OEPINT          (1u<<19)    //!< OUT endpoints interrupt
#define OTG_GINTSTS_IEPINT          (1u<<18)    //!< IN endpoints interrupt
#define OTG_GINTSTS_EOPF            (1u<<15)    //!< End of periodic frame interrupt
#define OTG_GINTSTS_ISOODRP         (1u<<14)    //!< Isochronous OUT packet dropped interrupt
#define OTG_GINTSTS_ENUMDNE         (1u<<13)    //!< Enumeration done
#define OTG_GINTSTS_USBRST          (1u<<12)    //!< USB reset
#define OTG_GINTSTS_USBSUSP         (1u<<11)    //!< USB suspend
#define OTG_GINTSTS_ESUSP           (1u<<10)    //!< Early suspend
#define OTG_GINTSTS_GONAKEFF        (1u<<7)     //!< Global OUT NAK effective
#define OTG_GINTSTS_GINAKEFF        (1u<<6)     //!< Global IN non-periodic NAK effective
#define OTG_GINTSTS_NPTXFE          (1u<<5)     //!< Non-periodic TxFIFO empty
#define OTG_GINTSTS_RXFLVL          (1u<<4)     //!< RxFIFO non-empty
#define OTG_GINTSTS_SOF             (1u<<3)     //!< Start of frame
#define OTG_GINTSTS_OTGINT          (1u<<2)     //!< OTG interrupt
#define OTG_GINTSTS_MMIS            (1u<<1)     //!< Mode Mismatch interrupt
#define OTG_GINTSTS_CMOD            (1u<<0)     //!< Current mode of operation
/** @} */

/** @name GINTMSK:  (otg Offset: 0x0018) Core Interrupt Mask Register			*/
/** @{ */
#define OTG_GINTMSK_WUIM            (1u<<31)    //!< Resume/remote wakeup detected interrupt mask
#define OTG_GINTMSK_SRQIM           (1u<<30)    //!< Session request/New session detected interrupt mask
#define OTG_GINTMSK_DISCINT         (1u<<29)    //!< Disconnect detected interrupt mask
#define OTG_GINTMSK_CIDSCHGM        (1u<<28)    //!< Connector ID status change mask
#define OTG_GINTMSK_PTXFEM          (1u<<26)    //!< Periodic TxFIFO empty mask
#define OTG_GINTMSK_HCIM            (1u<<25)    //!< Host channels interrupt mask
#define OTG_GINTMSK_PRTIM           (1u<<24)    //!< Host port interrupt mask
#define OTG_GINTMSK_RESETDET        (1u<<23)    //!< Device Reset detected Interrupt mask
#define OTG_GINTMSK_FETSUSP         (1u<<22)    //!< Data Fetch Suspended (FetSusp) mask
#define OTG_GINTMSK_IPXFRM          (1u<<21)    //!<  Host Incomplete periodic transfer mask
#define OTG_GINTMSK_IISOOXFRM       (1u<<21)    //!<  Device Incomplete isochronous OUT transfer mask
#define OTG_GINTMSK_IISOIXFRM       (1u<<20)    //!< Incomplete isochronous IN transfer mask
#define OTG_GINTMSK_OEPINT          (1u<<19)    //!< OUT endpoints interrupt mask
#define OTG_GINTMSK_IEPINT          (1u<<18)    //!< IN endpoints interrupt mask
#define OTG_GINTMSK_EPMISM          (1u<<17)    //!< Endpoint mismatch interrupt mask
#define OTG_GINTMSK_EOPFM           (1u<<15)    //!< End of periodic frame interrupt mask
#define OTG_GINTMSK_ISOODRPM        (1u<<14)    //!< Isochronous OUT packet dropped interrupt mask
#define OTG_GINTMSK_ENUMDNEM        (1u<<13)    //!< Enumeration done mask
#define OTG_GINTMSK_USBRST          (1u<<12)    //!< USB reset mask
#define OTG_GINTMSK_USBSUSPM        (1u<<11)    //!< USB suspend mask
#define OTG_GINTMSK_ESUSPM          (1u<<10)    //!< Early suspend mask
#define OTG_GINTMSK_GONAKEFFM       (1u<<7)     //!< Global OUT NAK effective mask
#define OTG_GINTMSK_GINAKEFFM       (1u<<6)     //!< Global non-periodic IN NAK effective mask
#define OTG_GINTMSK_NPTXFEM         (1u<<5)     //!< Non-periodic TxFIFO empty mask
#define OTG_GINTMSK_RXFLVLM         (1u<<4)     //!< Receive FIFO non-empty mask
#define OTG_GINTMSK_SOFM            (1u<<3)     //!< Start of (micro)frame mask
#define OTG_GINTMSK_OTGINT          (1u<<2)     //!< OTG interrupt mask
#define OTG_GINTMSK_MMISM           (1u<<1)     //!< Mode Mismatch interrupt
/** @} */

/** @name GRXSTSR:  (otg Offset: 0x001C) Receive Sts Q Read Register			*/
/** @{ */
#define OTG_GRXSTSR_PKTSTS_Msk      (15u<<17)   //!< Packet status mask
#define OTG_GRXSTSR_PKTSTS(n)       ((n)<<17)   //!< Packet status value
#define OTG_GRXSTSR_OUT_GLOBAL_NAK  GRXSTSR_PKTSTS(1)
#define OTG_GRXSTSR_OUT_DATA        GRXSTSR_PKTSTS(2)
#define OTG_GRXSTSR_OUT_COMP        GRXSTSR_PKTSTS(3)
#define OTG_GRXSTSR_SETUP_COMP      GRXSTSR_PKTSTS(4)
#define OTG_GRXSTSR_SETUP_DATA      GRXSTSR_PKTSTS(6)
#define OTG_GRXSTSR_DPID_Msk        (3u<<15)    //!< Data PID mask
#define OTG_GRXSTSR_DPID(n)         ((n)<<15)   //!< Data PID value
#define OTG_GRXSTSR_BCNT_Msk        (0x7FF<<4)  //!< Byte count mask
#define OTG_GRXSTSR_BCNT(n)         ((n)<<4)    //!< Byte count value
#define OTG_GRXSTSR_CHNUM_Msk       (15u<<0)    //!< Channel number mask
#define OTG_GRXSTSR_CHNUM(n)        ((n)<<0)    //!< Channel number value
#define OTG_GRXSTSR_EPNUM_Msk       (15u<<0)    //!< Endpoint number mask
#define OTG_GRXSTSR_EPNUM(n)        ((n)<<0)    //!< Endpoint number value
/** @} */

