miro-kostadinov/tmos/tmos/hardware/stm32/otg_hs_stm32.h
/** @name GRXSTSP:  (otg Offset: 0x0020) Receive Sts Q Read & POP Register		*/
/** @{ */
#define OTG_GRXSTSP_PKTSTS_Msk      (15<<17)    //!< Packet status mask
#define OTG_GRXSTSP_PKTSTS(n)       ((n)<<17)   //!< Packet status value
#define OTG_GRXSTSP_PKTSTS_NAK 		  (1 << 17)	//!<  Dev: Global OUT NAK (triggers an interrupt)
#define OTG_GRXSTSP_PKTSTS_OUT_DATA   (2 << 17)	//!<  Dev: OUT data packet received
#define OTG_GRXSTSP_PKTSTS_OUT_COMP   (3 << 17)	//!<  Dev: OUT transfer completed (triggers an interrupt)
#define OTG_GRXSTSP_PKTSTS_SETUP_COMP (4 << 17)	//!<  Dev: SETUP transaction completed (triggers an interrupt)
#define OTG_GRXSTSP_PKTSTS_SETUP_DATA (6 << 17)	//!<  Dev: SETUP data packet received

#define OTG_GRXSTSP_PKTSTS_IN_DATA    (2 << 17)	//!<  Host: IN data packet received
#define OTG_GRXSTSP_PKTSTS_IN_COMP    (3 << 17)	//!<  Host: IN transfer completed (triggers an interrupt)
#define OTG_GRXSTSP_PKTSTS_TOGGLE_ERR (5 << 17)	//!<  Host: Data toggle error (triggers an interrupt)
#define OTG_GRXSTSP_PKTSTS_EP_HALT	  (7 << 17)	//!<  Host: Channel halted (triggers an interrupt)

#define OTG_GRXSTSP_DPID_Msk        (3u<<15)    //!< Data PID mask
#define OTG_GRXSTSP_DPID(n)         ((n)<<15)   //!< Data PID value
#define OTG_GRXSTSP_BCNT_Msk        (0x7FF<<4)  //!< Byte count mask
#define OTG_GRXSTSP_BCNT_Get(x) (((x)>>4)&0x7FF)//!< Byte count get
#define OTG_GRXSTSP_BCNT(n)         ((n)<<4)    //!< Byte count value
#define OTG_GRXSTSP_CHNUM_Msk       (15u<<0)    //!< Channel number mask
#define OTG_GRXSTSP_CHNUM(n)        ((n)<<0)    //!< Channel number value
#define OTG_GRXSTSP_EPNUM_Msk       (15u<<0)    //!< Endpoint number mask
#define OTG_GRXSTSP_EPNUM(n)        ((n)<<0)    //!< Endpoint number value
/** @} */

/** @name GRXFSIZ:  (otg Offset: 0x0024) Receive FIFO Size Register				*/
/** @{ */
#define OTG_GRXFSIZ_RXFD_Msk        (0xFFFF<<0) //!< RxFIFO depth mask
#define OTG_GRXFSIZ_RXFD(n)         ((n)<<0)    //!< RxFIFO depth value
/** @} */

/** @name DIEPTXF0_HNPTXFSIZ; (otg Offset: 0x0028) EP0 / Non Periodic Tx FIFO Size Register*/
/** @{ */
#define OTG_DIEPTXF0_TX0FD_Msk     (0xFFFFu<<16)//!< Device Endpoint 0 TxFIFO depth mask
#define OTG_DIEPTXF0_TX0FD(n)       ((n)<<16)   //!< Device Endpoint 0 TxFIFO dept value
#define OTG_DIEPTXF0_TX0FSA_Msk     (0xFFFF<<0) //!< Device Endpoint 0 transmit RAM start address mask
#define OTG_DIEPTXF0_TX0FSA(n)      ((n)<<0)    //!< Device Endpoint 0 transmit RAM start address

#define OTG_HNPTXFSIZ_NPTXFD_Msk   (0xFFFFu<<16)//!< Host Non-periodic TxFIFO depth mask
#define OTG_HNPTXFSIZ_NPTXFD(n)     ((n)<<16)   //!< Host Non-periodic TxFIFO depth value
#define OTG_HNPTXFSIZ_NPTXFSA_Msk   (0xFFFF<<0) //!< Host Non-periodic transmit RAM start address mask
#define OTG_HNPTXFSIZ_NPTXFSA(n)    ((n)<<0)    //!< Host Non-periodic transmit RAM start address
/** @} */

/** @name GNPTXSTS; (otg Offset: 0x002C) Non Periodic Tx FIFO/Queue Sts reg		*/
/** @{ */
#define OTG_GNPTXSTS_NPTXQTOP_Get(x) (((x)>>24) & 0x7Fu) //!< Top of the nonperiodic transmit request queue get
#define OTG_GNPTXSTS_NPTXQTOP_CH_Get(x) (((x)>>27) & 0xFu) //!< Top of the nonperiodic transmit request queue channel get
#define OTG_GNPTXSTS_NPTQXSAV_Msk   (0xFFu<<16) //!< Nonperiodic transmit request queue space available mask
#define OTG_GNPTXSTS_NPTQXSAV_Get(x) (((x)>>16) & 0xFFu) //!< Nonperiodic transmit request queue space available get
#define OTG_GNPTXSTS_NPTXFSAV_Msk   (0xFFFF)	//!< Nonperiodic TxFIFO space available mask
#define OTG_GNPTXSTS_NPTXFSAV(n)    (n)			//!< Nonperiodic TxFIFO space available value
/** @} */

/** @name GCCFG;    (otg Offset: 0x0038) General Purpose IO Register			*/
/** @{ */
#define OTG_GCCFG_NOVBUSSENS        (1u<<21)    //!< VBUS sensing disable
#define OTG_GCCFG_SOFOUTEN          (1u<<20)    //!< SOF output enable
#define OTG_GCCFG_VBUSBSEN          (1u<<19)    //!< Enable the VBUS sensing "B" device
#define OTG_GCCFG_VBUSASEN          (1u<<18)    //!< Enable the VBUS sensing "A" device
#define OTG_GCCFG_PWRDWN            (1u<<16)    //!< Power down
/** @} */

/** @name CID;      (otg Offset: 0x003C) User ID Register						*/
/** @{ */
/** @} */

/** @name HPTXFSIZ; (otg Offset: 0x0100) Host periodic transmit FIFO size register */
/** @{ */
#define OTG_HPTXFSIZ_PTXFD_Msk     (0xFFFFu<<16)//!< Host periodic TxFIFO depth mask
#define OTG_HPTXFSIZ_PTXFD(n)       ((n)<<16)   //!< Host periodic TxFIFO depth value
#define OTG_HPTXFSIZ_PTXSA_Msk      (0xFFFFu<<0)//!< Host periodic TxFIFO Start address mask
#define OTG_HPTXFSIZ_PTXSA(n)       ((n)<<0)    //!< Host periodic TxFIFO start address value
/** @} */

/** @name DIEPTXF[OTG_MAX_FIFOS]; (otg Offset: 0x0104) device IN endpoint transmit FIFO size register */
/** @{ */
/** @} */

/** @} */ // @relates OTG_CORE_REGS



/* ---------- Host-mode registers 0x0400 --------------------------------------*/
/***************************************************************************//**
 * @relates OTG_HOST_REGS
 * @{
 ******************************************************************************/

/** @name HCFG; 	(otg Offset: 0x0400) Host Configuration Register			*/
/** @{ */
#define OTG_HCFG_FSLSS              (1u<<2)     //!< FS- and LS-only support
#define OTG_HCFG_FSLSPCS_Msk        (3u<<0)     //!< FS/LS PHY clock select mask
#define OTG_HCFG_FSLSPCS_48         (1u<<0)     //!< PHY clock is running at 48 MHz
#define OTG_HCFG_FSLSPCS_6          (2u<<0)     //!< PHY clock is running at 6 MHz
/** @} */

/** @name HFIR;     (otg Offset: 0x0404) Host Frame Interval Register			*/
/** @{ */
#define OTG_HFIR_FRIVL_Msk          (0xFFFFu<<0)//!< Frame interval mask
#define OTG_HFIR_FRIVL(n)           ((n)<<0)    //!< Frame interval value
/** @} */

/** @name HFNUM;    (otg Offset: 0x0408) Host Frame Nbr/Frame Remaining			*/
/** @{ */
#define OTG_HFNUM_FTREM_Msk        (0xFFFFu<<16)//!< Frame time Remaining mask
#define OTG_HFNUM_FTREM(n)          ((n)<<16)   //!< Frame time Remaining value
#define OTG_HFNUM_FRNUM_Msk         (0xFFFFu<<0)//!< Frame number mask
#define OTG_HFNUM_FRNUM(n)          ((n)<<0)    //!< Frame number value
/** @} */

/** @name HPTXSTS:  (otg Offset: 0x0410) Host Periodic Tx FIFO/ Queue Status	*/
/** @{ */
#define OTG_HPTXSTS_PTXQTOP_Msk     (0xFFu<<24) //!< Top of the periodic transmit request queue mask
#define OTG_HPTXSTS_PTXQTOP(n)      ((n)<<24)   //!< Top of the periodictransmit request queue value
#define OTG_HPTXSTS_PTXQSAV_Msk     (0xFF<<16)  //!< Periodic transmit request queue Space Available mask
#define OTG_HPTXSTS_PTXQSAV(n)      ((n)<<16)   //!< Periodic transmit request queue Space Available value
#define OTG_HPTXSTS_PTXFSAVL_Msk    (0xFFFF<<0) //!< Periodic transmit Data FIFO Space Available mask
#define OTG_HPTXSTS_PTXFSAVL(n)     ((n)<<0)    //!< Periodic transmit Data FIFO Space Available value
/** @} */

