miro-kostadinov/tmos/tmos/hardware/stm32/otg_hs_stm32.h
/** @name HAINT;   	(otg Offset: 0x0414) Host All Channels Interrupt Register	*/
/** @{ */
#define OTG_HAINT_HAINT_Msk         (0xFFFFu<<0)//!< Channel interrupts mask
#define OTG_HAINT_HAINT(n)          ((n)<<0)    //!< Channel interrupts value
/** @} */

/** @name HAINTMSK; (otg Offset: 0x0418) Host All Channels Interrupt Mask		*/
/** @{ */
#define OTG_HAINTMSK_HAINTM_Msk     (0xFFFFu<<0)//!< Channel interrupt mask mask
#define OTG_HAINTMSK_HAINTM(n)      ((n)<<0)    //!< Channel interrupt mask
/** @} */

/** @} */ // @relates OTG_HOST_REGS

/* ---------- Host port control and status register  0x0440  ------------------*/
/***************************************************************************//**
 * @relates USB_TypeDef
 * @{
 ******************************************************************************/
/** @name HPRT;		(otg Offset: 0x0440) Host port control and status register */
/** @{ */
#define OTG_HPRT_PSPD_Msk           (3u<<17)    //!< Port speed mask
#define OTG_HPRT_PSPD_FS            (1u<<17)    //!< Full speed value
#define OTG_HPRT_PSPD_LS            (2u<<17)    //!< Low speed value
#define OTG_HPRT_PTCTL_Msk          (15<<13)    //!< Port Test control mask
#define OTG_HPRT_PTCTL(n)           ((n)<<13)   //!< Port Test control value
#define OTG_HPRT_PPWR               (1u<<12)    //!< Port power
#define OTG_HPRT_PLSTS_Msk          (3u<<11)    //!< Port Line status mask
#define OTG_HPRT_PLSTS_DM           (1u<<11)    //!< Logic level of D-
#define OTG_HPRT_PLSTS_DP           (1u<<10)    //!< Logic level of D+
#define OTG_HPRT_PRST               (1u<<8)     //!< Port reset
#define OTG_HPRT_PSUSP              (1u<<7)     //!< Port suspend
#define OTG_HPRT_PRES               (1u<<6)     //!< Port Resume
#define OTG_HPRT_POCCHNG            (1u<<5)     //!< Port overcurrent change
#define OTG_HPRT_POCA               (1u<<4)     //!< Port overcurrent active
#define OTG_HPRT_PENCHNG            (1u<<3)     //!< Port enable/disable change
#define OTG_HPRT_PENA               (1u<<2)     //!< Port enable
#define OTG_HPRT_PCDET              (1u<<1)     //!< Port Connect detected
#define OTG_HPRT_PCSTS              (1u<<0)     //!< Port connect status
#define OTG_HPRT_rc_w1_bits         (OTG_HPRT_PENA    | OTG_HPRT_PCDET | OTG_HPRT_PENCHNG | OTG_HPRT_POCCHNG)     //!< rc_w1 bits (PENA is rc_w0 according to the RM v.6 but more likely is not)
/** @} */
/** @} */ // @relates USB_TypeDef


/* ---------- Host channel-specific registers  0x0500, 0x0520... --------------*/
/***************************************************************************//**
 * @relates OTG_HC_REGS
 * @{
 ******************************************************************************/

/** @name HCCHAR;   (otg Offset: 0x0500+) Host channel-x characteristics register */
/** @{ */
#define OTG_HCCHAR_CHENA            (1u<<31)    //!< Channel enable
#define OTG_HCCHAR_CHDIS            (1u<<30)    //!< Channel Disable
#define OTG_HCCHAR_ODDFRM           (1u<<29)    //!< Odd frame
#define OTG_HCCHAR_DAD_Msk          (0x7Fu<<22) //!< Device Address mask
#define OTG_HCCHAR_DAD(n)           ((n)<<22)   //!< Device Address value
#define OTG_HCCHAR_MCNT_Msk         (3u<<20)    //!< Multicount mask
#define OTG_HCCHAR_MCNT(n)          ((n)<<20)   //!< Multicount value
#define OTG_HCCHAR_EPTYP_Msk        (3u<<18)    //!< Endpoint type mask
#define OTG_HCCHAR_EPTYP(n)         ((n)<<18)   //!< Endpoint type value
#define OTG_HCCHAR_EPTYP_CTL        (0u<<18)    //!< Control endpoint value
#define OTG_HCCHAR_EPTYP_ISO        (1u<<18)    //!< Isochronous endpoint value
#define OTG_HCCHAR_EPTYP_BULK       (2u<<18)    //!< Bulk endpoint value
#define OTG_HCCHAR_EPTYP_INTR       (3u<<18)    //!< Interrupt endpoint value
#define OTG_HCCHAR_LSDEV            (1u<<17)    //!< Low-Speed device
#define OTG_HCCHAR_EPDIR            (1u<<15)    //!< Endpoint direction
#define OTG_HCCHAR_EPNUM_Msk        (15u<<11)   //!< Endpoint number mask
#define OTG_HCCHAR_EPNUM(n)         ((n)<<11)   //!< Endpoint number value
#define OTG_HCCHAR_MPS_Msk          (11u<<0)    //!< Maximum packet size mask
#define OTG_HCCHAR_MPS(n)           ((n)<<0)    //!< Maximum packet size value
/** @} */

/** @name HCSPLT;   (otg Offset: 0x0504+) host channel-x split control register */
/** @{ */
/** @} */

/** @name HCINT;    (otg Offset: 0x0508+) Host channel-x interrupt register */
/** @{ */
#define OTG_HCINT_DTERR             (1u<<10)    //!< Data toggle error
#define OTG_HCINT_FRMOR             (1u<<9)     //!< Frame overrun
#define OTG_HCINT_BBERR             (1u<<8)     //!< Babble error
#define OTG_HCINT_TRERR             (1u<<7)     //!< Transaction Error
#define OTG_HCINT_NYET              (1u<<6)     //!< Response received
#define OTG_HCINT_ACK               (1u<<5)     //!< ACK response received/transmitted interrupt
#define OTG_HCINT_NAK               (1u<<4)     //!< NAK response received interrupt
#define OTG_HCINT_STALL             (1u<<3)     //!< STALL response received interrupt
#define OTG_HCINT_AHBERR            (1u<<2)     //!< AHB error
#define OTG_HCINT_CHH               (1u<<1)     //!< Channel halted
#define OTG_HCINT_XFRC              (1u<<0)     //!< Transfer completed
/** @} */

/** @name HCINTMSK; (otg Offset: 0x050C+) Host channel-x interrupt mask register */
/** @{ */
#define OTG_HCINTMSK_DTERRM         (1u<<10)    //!< Data toggle error mask
#define OTG_HCINTMSK_FRMORM         (1u<<9)     //!< Frame overrun mask
#define OTG_HCINTMSK_BBERRM         (1u<<8)     //!< Babble error mask
#define OTG_HCINTMSK_TRERRM         (1u<<7)     //!< Transaction error mask
#define OTG_HCINTMSK_NYET           (1u<<6)     //!< NYET response received interrupt mask
#define OTG_HCINTMSK_ACKM           (1u<<5)     //!< ACK Response received/transmitted interrupt mask
#define OTG_HCINTMSK_NAKM           (1u<<4)     //!< NAK response received interrupt mask
#define OTG_HCINTMSK_STALLM         (1u<<3)     //!< STALL response received interrupt mask
#define OTG_HCINTMSK_CHHM           (1u<<1)     //!< Channel halted mask
#define OTG_HCINTMSK_XFRCM          (1u<<0)     //!< Transfer completed mask
/** @} */

/** @name HCTSIZ;   (otg Offset: 0x0510+) Host channel-x transfer size register */
/** @{ */
#define OTG_HCTSIZ_DPID_Msk         (3u<<29)    //!< PID mask
#define OTG_HCTSIZ_DPID_DATA0       (0u<<29)    //!< DATA0
#define OTG_HCTSIZ_DPID_DATA2       (1u<<29)    //!< DATA2
#define OTG_HCTSIZ_DPID_DATA1       (2u<<29)    //!< DATA1
#define OTG_HCTSIZ_DPID_MDATA       (3u<<29)    //!< MDATA
#define OTG_HCTSIZ_PKTCNT_Msk       (0x3FFu<<19)//!< Packet count mask
#define OTG_HCTSIZ_PKTCNT(n)        ((n)<<19)   //!< Packet count value
#define OTG_HCTSIZ_XFRSIZ_Msk       (0x7FFFF<<0)//!< Transfer size mask
#define OTG_HCTSIZ_XFRSIZ(n)        ((n)<<0)    //!< Transfer size value
/** @} */

/** @name HCDMA;    (otg Offset: 0x0514+) host channel-x DMA address register */
/** @} */

/** @} */ // @relates OTG_HC_REGS



/* ---------- Device mode CSRs 0x0800 -----------------------------------------*/
/***************************************************************************//**
 * @relates OTG_DEVICE_REGS
 * @{
 ******************************************************************************/

/** @name DCFG;     (otg Offset: 0x0800) device Configuration Register			*/
/** @{ */
#define OTG_DCFG_PFIVL_Msk          (3u<<11)    //!< Periodic frame interval mask
#define OTG_DCFG_PFIVL(n)           ((n)<<11)   //!< Periodic frame interval value
#define OTG_DCFG_PFIVL_80      		(0u<<11)    //!<  80% of the frame interval
#define OTG_DCFG_PFIVL_85       	(1u<<11)    //!<  85% of the frame interval
#define OTG_DCFG_PFIVL_90   	    (1u<<11)    //!<  80% of the frame interval
#define OTG_DCFG_PFIVL_95	        (3u<<11)    //!<  95% of the frame interval
#define OTG_DCFG_DAD_Msk            (0x7Fu<<4)  //!< Device address mask
#define OTG_DCFG_DAD(n)             ((n)<<4)    //!< Device address value
#define OTG_DCFG_NZLSOHSK           (1u<<2)     //!< Non-Zero-Length status OUT handshake
#define OTG_DCFG_DSPD_Msk	        (3u<<0)     //!< Device speed mask
#define OTG_DCFG_DSPD_HS            (0u<<0)     //!< High speed (USB 2.0)
#define OTG_DCFG_DSPD_HS_FS         (1u<<0)     //!< High speed (USB 2.0) in FS mode
#define OTG_DCFG_DSPD_FS11          (3u<<0)     //!< Full speed (USB 1.1 transceiver clock is 48 MHz)
/** @} */

/** @name DCTL;     (otg Offset: 0x0804) device Control Register				*/
/** @{ */
#define OTG_DCTL_POPRGDNE           (1u<<11)    //!< Power-on programming done
#define OTG_DCTL_CGONAK             (1u<<10)    //!< Clear global OUT NAK
#define OTG_DCTL_SGONAK             (1u<<9)     //!< Set global OUT NAK
#define OTG_DCTL_CGINAK             (1u<<8)     //!< Clear global non-periodic IN NAK
#define OTG_DCTL_SGINAK             (1u<<7)     //!< Set global non-periodic IN NAK
#define OTG_DCTL_TCTL_Msk           (7u<<4)     //!< Test control mask
#define OTG_DCTL_TCTL(n)            ((n)<<4     //!< Test control value
#define OTG_DCTL_GONSTS             (1u<<3)     //!< Global OUT NAK status
#define OTG_DCTL_GINSTS             (1u<<2)     //!< Global non-periodic IN NAK status
#define OTG_DCTL_SDIS               (1u<<1)     //!< Soft disconnect
#define OTG_DCTL_RWUSIG             (1u<<0)     //!< Remote wakeup signaling
/** @} */

/** @name DSTS;     (otg Offset: 0x0808) device Status Register (RO)			*/
/** @{ */
#define OTG_DSTS_FNSOF_Msk          (0x3FFu<<8) //!< Frame number of the received SOF mask
#define OTG_DSTS_FNSOF(n)           ((n)<<8)    //!< Frame number of the received SOF value
#define OTG_DSTS_FNSOF_ODD          ((1)<<8)    //!<  Frame number of the received SOF value
#define OTG_DSTS_EERR               (1u<<3)     //!< Erratic error
#define OTG_DSTS_ENUMSPD_Msk        (3u<<1)     //!< Enumerated speed mask
#define OTG_DSTS_ENUMSPD_HS_30_60   (0u<<1)     //!<  High speed (PHY is running at 30 or 60 MHz)
#define OTG_DSTS_ENUMSPD_FS_30_60   (1u<<1)     //!<  Full speed (PHY is running at 30 or 60 MHz)
#define OTG_DSTS_ENUMSPD_LS_6       (2u<<1)     //!<  Low speed (PHY is running at 6 MHz)
#define OTG_DSTS_ENUMSPD_FS_48      (3u<<1)     //!<  Full speed (PHY is running at 48 MHz)
#define OTG_DSTS_SUSPSTS            (1u<<0)     //!< Suspend status
/** @} */

/** @name DIEPMSK:  (otg Offset: 0x0810) device IN Endpoint Mask				*/
/** @{ */
#define OTG_DIEPMSK_BIM             (1u<<9)     //!< BNA interrupt mask
#define OTG_DIEPMSK_TXFURM          (1u<<8)     //!< FIFO underrun mask
#define OTG_DIEPMSK_TXFEM           (1u<<6)     //!< Transmit FIFO empty mask
#define OTG_DIEPMSK_INEPNEM         (1u<<6)     //!< IN endpoint NAK effective mask
#define OTG_DIEPMSK_ITTXFEMSK       (1u<<4)     //!< IN token received when TxFIFO empty mask
#define OTG_DIEPMSK_TOCM            (1u<<3)     //!< Timeout condition mask
#define OTG_DIEPMSK_EPDM            (1u<<1)     //!< Endpoint disabled interrupt mask
#define OTG_DIEPMSK_XFRCM           (1u<<0)     //!< Transfer completed
/** @} */

