miro-kostadinov/tmos/tmos/hardware/stm32/otg_hs_stm32.h
/** @name DOEPMSK:  (otg Offset: 0x0814) device OUT Endpoint Mask				*/
/** @{ */
#define OTG_DOEPMSK_BOIM            (1u<<9)     //!< BNA interrupt mask
#define OTG_DOEPMSK_OPEM            (1u<<8)     //!< OUT packet error mask
#define OTG_DOEPMSK_B2BSTUP         (1u<<6)     //!< Back-to-back SETUP packets received mask
#define OTG_DOEPMSK_OTEPDM          (1u<<4)     //!< OUT token received when endpoint disabled mask
#define OTG_DOEPMSK_STUPM           (1u<<3)     //!< SETUP phase done mask
#define OTG_DOEPMSK_EPDM            (1u<<1)     //!< Endpoint disabled interrupt mask
#define OTG_DOEPMSK_XFRCM           (1u<<0)     //!< Transfer completed interrupt mask
/** @} */

/** @name DAINT;    (otg Offset: 0x0818) device All Endpoints Itr Reg			*/
/** @{ */
#define OTG_DAINT_OEPINT_Msk        (0xFFFFu<<16)//!< OUT endpoint interrupt bits mask
#define OTG_DAINT_OEPINT(n)         ((n)<<16)   //!< OUT endpoint interrupt bits value
#define OTG_DAINT_IEPINT_Msk        (0xFFFFu<<0)//!< IN endpoint interrupt bits mask
#define OTG_DAINT_IEPINT(n)         ((n)<<0)    //!< IN endpoint interrupt bits value
/** @} */

/** @name DAINTMSK; (otg Offset: 0x081C) device All Endpoints Itr Mask			*/
/** @{ */
#define OTG_DAINTMSK_OEPM_Msk       (0xFFFFu<<16)//!< OUT EP interrupt mask bits mask
#define OTG_DAINTMSK_OEPM(n)        (1u<<(16+(n)))//!< OUT EP interrupt mask bits value
#define OTG_DAINTMSK_IEPM_Msk       (0xFFFFu<<0)//!< IN EP interrupt mask bits mask
#define OTG_DAINTMSK_IEPM(n)        (1u<<(n))   //!< IN EP interrupt mask bits value
/** @} */

/** @name DVBUSDIS; (otg Offset: 0x0828) device VBUS discharge Register			*/
/** @{ */
#define OTG_DVBUSDIS_VBUSDT_Msk     (0xFFFFu<<0)//!< Device VBUS discharge time mask
#define OTG_DVBUSDIS_VBUSDT(n)      ((n)<<0)    //!< Device VBUS discharge time value
/** @} */

/** @name DVBUSPULSE   (otg Offset: 0x082C) device VBUS Pulse Register			*/
/** @{ */
#define OTG_DVBUSPULSE_DVBUSP_Msk   (0xFFFu<<0) //!< Device VBUSpulsing time mask
#define OTG_DVBUSPULSE_DVBUSP(n)    ((n)<<0)    //!< Device VBUS pulsing time value
/** @} */

/** @name DTHRCTL;     (otg Offset: 0x0830) device thr							*/
/** @{ */
#define OTG_DTHRCTL_ARPEN           (1u<<27)    //!< Arbiter parking enable
#define OTG_DTHRCTL_RXTHRLEN_Msk    (0x1FFu<<17)//!< Receive threshold length mask
#define OTG_DTHRCTL_RXTHRLEN(n)     ((n)<<17)   //!< Receive threshold length set
#define OTG_DTHRCTL_RXTHREN         (1u<<16)    //!< Receive threshold enable
#define OTG_DTHRCTL_TXTHRLEN_Msk    (0x1FFu<<2) //!< Transmit threshold length mask
#define OTG_DTHRCTL_TXTHRLEN(n)     ((n)<<2)    //!< Transmit threshold length set
#define OTG_DTHRCTL_ISOTHREN        (1u<<1)     //!< ISO IN endpoint threshold enable
#define OTG_DTHRCTL_NONISOTHREN     (1u<<0)     //!< Nonisochronous IN endpoints threshold enable
/** @} */

/** @name DIEPEMPMSK:  (otg Offset: 0x0834) device empty msk					*/
/** @{ */
#define OTG_DIEPEMPMSK_INEPTXFEM(n) (1u<<(n))   //!< IN EP Tx FIFO empty interrupt mask bit
/** @} */

/** @name DEACHINT;    (otg Offset: 0x0838) dedicated EP interrupt				*/
/** @{ */
#define OTG_DEACHINT_OEP1INT        (1u<<17)    //!< OUT endpoint 1 interrupt bit
#define OTG_DEACHINT_IEP1INT        (1u<<1)     //!< IN endpoint 1interrupt bit
/** @} */

/** @name DEACHINTMSK; (otg Offset: 0x083C) dedicated EP msk					*/
/** @{ */
#define OTG_DEACHINTMSK_OEP1INTM    (1u<<17)    //!< OUT endpoint 1 interrupt mask bit
#define OTG_DEACHINTMSK_IEP1INT     (1u<<1)     //!< IN endpoint 1interrupt mask bit
/** @} */

/** @name DIEPEACHMSK1;(otg Offset: 0x0840) dedicated in EP-1 interrupt			*/
/** @{ */
/** @} */

/** @name DINEP1MSK;   (otg Offset: 0x0844) dedicated EP mask					*/
/** @{ */
/** @} */

/** @name DOEPEACHMSK1;(otg Offset: 0x0880) device each OUT endpoint-1 interrupt register */
/** @{ */
/** @} */

/** @name DOUTEP1MSK:  (otg Offset: 0x0884) dedicated EP msk					*/
/** @{ */
/** @} */

/** @} */ // @relates OTG_DEVICE_REGS


/* ---------- Device IN Endpoint CSRs 0x0900, 0x0920... -----------------------*/
/***************************************************************************//**
 * @relates OTG_IN_EPT_REGS
 * @{
 ******************************************************************************/

/** @name DIEPCTL: 	(otg Offset: 0x0900+) dev IN Endpoint Control Reg			*/
/** @{ */
#define OTG_DIEPCTL_EPENA           (1u<<31)    //!< Endpoint enable
#define OTG_DIEPCTL_EPDIS           (1u<<30)    //!< Endpoint disable
#define OTG_DIEPCTL_SD1PID          (1u<<29)    //!< Set DATA1 PID	(ep 1..7)
#define OTG_DIEPCTL_SODDFRM         (1u<<29)    //!< Set odd frame	(ep 1..7)
#define OTG_DIEPCTL_SD0PID          (1u<<28)    //!< Set DATA0 PID	(ep 1..7)
#define OTG_DIEPCTL_SEVNFRM         (1u<<28)    //!< Set even frame	(ep 1..7)
#define OTG_DIEPCTL_SNAK            (1u<<27)    //!< Set NAK.
#define OTG_DIEPCTL_CNAK            (1u<<26)    //!< Clear NAK
#define OTG_DIEPCTL_TXFNUM_Msk	    (0xFu<<22)  //!< TxFIFO number mask.  (ep 1..7)
#define OTG_DIEPCTL_TXFNUM(n)       ((n)<<22)   //!< TxFIFO number value. (ep 1..7)
#define OTG_DIEPCTL_STALL           (1u<<21)    //!< STALL handshake.
#define OTG_DIEPCTL_SNPM            (1u<<20)    //!< Snoop mode.
#define OTG_DIEPCTL_EPTYP_Msk       (3<<18)     //!< Endpoint type mask.
#define OTG_DIEPCTL_EPTYP(n)        ((n)<<18)   //!<  Endpoint type value.
#define OTG_DIEPCTL_EPTYP_CTRL      (0u<<18)    //!<  Control.
#define OTG_DIEPCTL_EPTYP_ISO       (1u<<18)    //!<  Isochronous.
#define OTG_DIEPCTL_EPTYP_BULK      (2u<<18)    //!<  Bulk.
#define OTG_DIEPCTL_EPTYP_INTR      (3u<<18)    //!<  Interrupt.
#define OTG_DIEPCTL_NAKSTS          (1u<<17)    //!< NAK status.
#define OTG_DIEPCTL_EONUM           (1u<<16)    //!< Even/odd frame.		(ep 1..7)
#define OTG_DIEPCTL_DPID            (1u<<16)    //!< Endpoint data PID.		(ep 1..7)
#define OTG_DIEPCTL_USBAEP          (1u<<15)    //!< USB active endpoint.
#define OTG_DIEPCTL_MPSIZ_Msk       (0x3FFu<<0) //!< Maximum Packet size mask. (0x3 for ep0)
#define OTG_DIEPCTL_MPSIZ(n)        ((n)<<0)    //!< Maximum Packet size value.
/** @} */

/** @name DIEPINT: 	(otg Offset: 0x0908+) dev IN Endpoint Itr Reg				*/
/** @{ */
#define OTG_DIEPINT_TXFE            (1u<<7)     //!< Transmit FIFO empty
#define OTG_DIEPINT_INEPNE          (1u<<6)     //!< IN endpoint NAK effective
#define OTG_DIEPINT_ITTXFE          (1u<<4)     //!< IN Token received when TxFIFO is empty
#define OTG_DIEPINT_TOC             (1u<<3)     //!< Timeout condition
#define OTG_DIEPINT_EPDISD          (1u<<1)     //!< Endpoint disabled interrupt
#define OTG_DIEPINT_XFRC            (1u<<0)     //!< Transfer completed
/** @} */

/** @name DIEPTSIZ: (otg Offset: 0x0910+) IN Endpoint Txfer Size				*/
/** @{ */
#define OTG_DIEPTSIZ_MCNT_Msk       (3u<<29)  	//!< Multi count mask.
#define OTG_DIEPTSIZ_MCNT(n)        ((n)<<29)   //!< Multi count value.
#define OTG_DIEPTSIZ_PKTCNT_Msk    (0x3FFu<<19) //!< Packet count mask.
#define OTG_DIEPTSIZ_PKTCNT(n)      ((n)<<19)   //!< Packet count value.
#define OTG_DIEPTSIZ_XFRSIZ_Msk   (0x7FFFFu<<0) //!< Transfer size mask.
#define OTG_DIEPTSIZ_XFRSIZ(n)      ((n)<<0)    //!< Transfer size value.
/** @} */

/** @name DTXFSTS:	(otg Offset: 0x0918+) IN Endpoint Tx FIFO Status Reg		*/
/** @{ */
#define DTXFSTS_INEPTFSAV_Msk       (0xFFFFu<<0) //!< IN endpoint TxFIFO space  available.                 */
/** @} */

