miro-kostadinov/tmos/tmos/hardware/stm32/otg_hs_stm32.h
/** @} */ // @relates OTG_IN_EPT_REGS


/* ---------- Device OUT Endpoint CSRs 0x0B00, 0x0B20... ----------------------*/
/***************************************************************************//**
 * @relates OTG_OUT_EPT_REGS
 * @{
 ******************************************************************************/

/** @name DOEPCTL:   (otg Offset: 0x0B00+) dev OUT Endpoint Control Reg			*/
/** @{ */
#define OTG_DOEPCTL_EPENA           (1u<<31)    //!< Endpoint enable.
#define OTG_DOEPCTL_EPDIS           (1u<<30)    //!< Endpoint disable.
#define OTG_DOEPCTL_SD1PID          (1u<<29)    //!< Set DATA1 PID.
#define OTG_DOEPCTL_SODDFRM         (1u<<29)    //!< Set odd frame.
#define OTG_DOEPCTL_SD0PID         	(1u<<28)    //!< Set DATA0 PID.
#define OTG_DOEPCTL_SEVNFRM         (1u<<28)    //!< Set even frame.
#define OTG_DOEPCTL_SNAK            (1u<<27)    //!< Set NAK.
#define OTG_DOEPCTL_CNAK            (1u<<26)    //!< Clear NAK.
#define OTG_DOEPCTL_STALL           (1u<<21)    //!< STALL handshake.
#define OTG_DOEPCTL_SNPM            (1u<<20)    //!< Snoop mode.
#define OTG_DOEPCTL_EPTYP_Msk	    (3u<<18)    //!< Endpoint type mask.
#define OTG_DOEPCTL_EPTYP(n)	    ((n)<<18)   //!<  Endpoint type value
#define OTG_DOEPCTL_EPTYP_CTRL      (0u<<18)    //!<  Control.
#define OTG_DOEPCTL_EPTYP_ISO       (1u<<18)    //!<  Isochronous.
#define OTG_DOEPCTL_EPTYP_BULK      (2u<<18)    //!<  Bulk.
#define OTG_DOEPCTL_EPTYP_INTR      (3u<<18)    //!<  Interrupt.
#define OTG_DOEPCTL_NAKSTS          (1u<<17)    //!< NAK status.
#define OTG_DOEPCTL_EONUM           (1u<<16)    //!< Even/odd frame.
#define OTG_DOEPCTL_DPID            (1u<<16)    //!< Endpoint data PID.
#define OTG_DOEPCTL_USBAEP          (1u<<15)    //!< USB active endpoint.
#define OTG_DOEPCTL_MPSIZ_Msk       (0x3FFu<<0) //!< Maximum Packet size mask.
#define OTG_DOEPCTL_MPSIZ(n)        ((n)<<0)    //!< Maximum Packet size value.
/** @} */

/** @name DOEPINT:   (otg Offset: 0x0B08+) dev OUT Endpoint Itr Reg				*/
/** @{ */
#define OTG_DOEPINT_B2BSTUP         (1u<<6)     //!< Back-to-back SETUP packets received
#define OTG_DOEPINT_OTEPDIS         (1u<<4)     //!< OUT token received when endpoint disabled
#define OTG_DOEPINT_STUP            (1u<<3)     //!< SETUP phase done
#define OTG_DOEPINT_EPDISD          (1u<<1)     //!< Endpoint disabled interrupt
#define OTG_DOEPINT_XFRC            (1u<<0)     //!< Transfer completed interrupt
/** @} */

/** @name DOEPTSIZ:  (otg Offset: 0x0B10+) dev OUT Endpoint Txfer Size			*/
/** @{ */
#define OTG_DOEPTSIZ_RXDPID_Msk     (3u<<29)    //!< Received data PID mask.
#define OTG_DOEPTSIZ_RXDPID(n)      ((n)<<29)   //!< Received data PID value.
#define OTG_DOEPTSIZ_STUPCNT_Msk    (3u<<29)    //!< SETUP packet count mask.
#define OTG_DOEPTSIZ_STUPCNT(n)     ((n)<<29)   //!< SETUP packet count value.
#define OTG_DOEPTSIZ_PKTCNT_Msk    (0x3FFu<<19) //!< Packet count mask.
#define OTG_DOEPTSIZ_PKTCNT(n)      ((n)<<19)   //!< Packet count value.
#define OTG_DOEPTSIZ_XFRSIZ_Msk    (0x7FFFFu<<0)//!< Transfer size mask.
#define OTG_DOEPTSIZ_XFRSIZ(n)      ((n)<<0)    //!< Transfer size value.
/** @} */

/** @name DOEPDMA:   (otg Offset: 0x0B14+) dev OUT Endpoint DMA Address   		*/
/** @{ */
/** @} */

/** @name PCGCCTL: 	(otg Offset: 0x0E00) power and clock gating control register */
/** @{ */
#define OTG_PCGCCTL_PHYSUSP         (1u<<4)     //!< PHY suspended
#define OTG_PCGCCTL_GATEHCLK        (1u<<1)     //!< Gate HCLK
#define OTG_PCGCCTL_STPPCLK         (1u<<0)     //!< Stop PHY clock
/** @} */

/** @} */ // @relates OTG_OUT_EPT_REGS


#endif /* OTG_HS_STM32_H_ */

/** @} */
